"""

6. Реализовать два небольших скрипта:
● итератор, генерирующий целые числа, начиная с указанного;
● итератор, повторяющий элементы некоторого списка, определённого заранее.

Подсказка: используйте функцию count() и cycle() модуля itertools. Обратите внимание, что
создаваемый цикл не должен быть бесконечным. Предусмотрите условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3. При достижении числа 10 —
завершаем цикл. Вторым пунктом необходимо предусмотреть условие, при котором
повторение элементов списка прекратится.

"""

from itertools import count
from itertools import cycle

for i in count(int(input('Введите стартовое число '))):
    print(i, " ", end="")
    if i >= 10:
        print()
        break

print()

my_list = ["A", "B", "C", "D"]
counter = 0
for i in cycle(my_list):
    print(i, " ", end="")
    counter += 1
    if counter % len(my_list) == 0:
        print()
    if counter >= len(my_list) * 5:
        print()
        break
